In [33]:
#Venkat was here
# hello-world-predictor.ipynb
# Objective: Read the dataset, do a simple prediction for games on a given date using data prior to that date, then
#            and record some stats on how well it did.
# 
# Modules
import os
import csv
import pprint
import pandas as pd

# Set path for file
csvpath = os.path.join("..", "datasets", "Final_Data_Files", "GL2010.csv")
print(csvpath)

season_df = pd.read_csv(csvpath, delimiter=",")
season_df.head()

../datasets/Final_Data_Files/GL2010.csv

,20100404,0,Sun,NYA,AL,1,BOS,AL.1,1.1,7,...,J.D. Drew,9.4,camem001,Mike Cameron,8.4,scutm001,Marco Scutaro,6.5,Unnamed: 159,Y
0,20100405,0,Mon,MIN,AL,1,ANA,AL,1,3,...,Howie Kendrick,4,woodb003,Brandon Wood,5,mathj001,Jeff Mathis,2,NaN,Y
1,20100405,0,Mon,CLE,AL,1,CHA,AL,1,0,...,A.J. Pierzynski,2,teahm001,Mark Teahen,5,ramia003,Alexei Ramirez,6,NaN,Y
2,20100405,0,Mon,DET,AL,1,KCA,AL,1,8,...,Yuniesky Betancourt,6,kendj001,Jason Kendall,2,getzc001,Chris Getz,4,NaN,Y
3,20100405,0,Mon,SEA,AL,1,OAK,AL,1,5,...,Mark Ellis,4,buckt001,Travis Buck,7,pennc001,Cliff Pennington,6,NaN,Y
4,20100405,0,Mon,TOR,AL,1,TEX,AL,1,4,...,Jarrod Saltalamacchia,2,blana001,Andres Blanco,4,andre001,Elvis Andrus,6,NaN,Y

In [34]:
season_df.shape # Useful to make sure we don't loose rows when adding column headers.

(2429, 161)

In [35]:
# Add Column headers by number
col_headers = [("Col_"+str(i)) for i in range(1,season_df.shape[1]+1)]
season_df.columns = col_headers
season_df.head()

,Col_1,Col_2,Col_3,Col_4,Col_5,Col_6,Col_7,Col_8,Col_9,Col_10,...,Col_152,Col_153,Col_154,Col_155,Col_156,Col_157,Col_158,Col_159,Col_160,Col_161
0,20100405,0,Mon,MIN,AL,1,ANA,AL,1,3,...,Howie Kendrick,4,woodb003,Brandon Wood,5,mathj001,Jeff Mathis,2,NaN,Y
1,20100405,0,Mon,CLE,AL,1,CHA,AL,1,0,...,A.J. Pierzynski,2,teahm001,Mark Teahen,5,ramia003,Alexei Ramirez,6,NaN,Y
2,20100405,0,Mon,DET,AL,1,KCA,AL,1,8,...,Yuniesky Betancourt,6,kendj001,Jason Kendall,2,getzc001,Chris Getz,4,NaN,Y
3,20100405,0,Mon,SEA,AL,1,OAK,AL,1,5,...,Mark Ellis,4,buckt001,Travis Buck,7,pennc001,Cliff Pennington,6,NaN,Y
4,20100405,0,Mon,TOR,AL,1,TEX,AL,1,4,...,Jarrod Saltalamacchia,2,blana001,Andres Blanco,4,andre001,Elvis Andrus,6,NaN,Y

In [36]:
season_df.shape

(2429, 161)

In [37]:
season_df = season_df.rename(columns={'Col_1':'Date',
                                     'Col_4':'Visiting Team',
                                     'Col_5':'Visiting League',
                                     'Col_7':'Home Team',
                                     'Col_8':'Home League',
                                     'Col_10':'Visiting Score',
                                     'Col_11':'Home Score'})
season_df = season_df[['Date', 'Visiting Team', 'Visiting League', 'Home Team', 'Home League',
                       'Visiting Score','Home Score']]
season_df.head()

,Date,Visiting Team,Visiting League,Home Team,Home League,Visiting Score,Home Score
0,20100405,MIN,AL,ANA,AL,3,6
1,20100405,CLE,AL,CHA,AL,0,6
2,20100405,DET,AL,KCA,AL,8,4
3,20100405,SEA,AL,OAK,AL,5,3
4,20100405,TOR,AL,TEX,AL,4,5